jutoroa/STM32F411RE/examenFinal_jutoroaV4/Src/examenFinalMainV4.c
/*
 * I2CMPU6050.c
 *
 *  Created on: 4/05/2022
 *  Author: Juan Pablo
 *
 * // *************** // Examen Final Taller V // *************** //
 */


// *************** // INCLUDES // *************** //

#include <stm32f4xx.h>
#include <stdlib.h>
#include <string.h>
#include <stdio.h>
#include <stdint.h>
#include <stdbool.h>

#include "GPIOxDriver.h"
#include "USARTxDriver.h"
#include "TIMxDriver.h"
#include "AdcDriver.h"
#include "EXTIxDriver.h"
#include "I2CxDriver.h"
#include "SysTickDriver.h"
#include "MPU6050Driver.h"
#include "rtcDS1307Driver.h"
#include "OLEDDriver.h"
#include "FPUDriver.h"

// *************** // VARIABLES PROYECTO // *************** //

// Handler para todos los periféricos que se van a implementar en el desarrollo del proyecto
GPIO_Handler_t 	handlerStateLED 		= {0};	// StateLED
GPIO_Handler_t 	handlerPinTX 			= {0};	// handlerPinTX
GPIO_Handler_t 	handlerPinRX 			= {0};	// handlerPinRX

GPIO_Handler_t 	handlerPinSTART 			= {0};	// handlerPinSTART
GPIO_Handler_t 	handlerPinSTOP 				= {0};	// handlerPinSTOP
GPIO_Handler_t 	handlerPinBUZZER 			= {0};	// handlerPinBUZZER

TIMER_Handler_t handlerTimer2 			= {0};	// Timer2
TIMER_Handler_t handlerTimer5 			= {0};	// Timer5
TIMER_Handler_t handlerTimer4 			= {0};	// Timer4
USART_Handler_t handlerCommTerminal		= {0};	// Usart para la terminal en USART 6

/* Configuración para el I2C */
GPIO_Handler_t handlerI2CSDA_MPU6050 			= {0};	// SDA para el I2C	MPU6050
GPIO_Handler_t handlerI2CSCL_MPU6050			= {0};	// SCL para el I2C	MPU6050
I2C_Handler_t  handler_MPU6050	 				= {0};	// I2C (1) para el RTC	MPU6050

GPIO_Handler_t handlerI2CSDA_RTC 				= {0};	// SDA para el I2C	RTC DS1307
GPIO_Handler_t handlerI2CSCL_RTC 				= {0};	// SCL para el I2C	RTC DS1307
I2C_Handler_t  handler_RTC	 					= {0};	// I2C (2) para el  RTC DS1307

GPIO_Handler_t handlerI2CSDA_OLED 				= {0};	// SDA para el I2C	OLED 1.3"
GPIO_Handler_t handlerI2CSCL_OLED 				= {0};	// SCL para el I2C	OLED 1.3"
I2C_Handler_t  handler_OLED	 					= {0};	// I2C (3) para el  OLED 1.3"

/* Variables para la configuración del RTC */
rtc_t			dateAndTimeRTC = {0};					// Estructura que permite almacenar los valores iniciales para definir la fecha y el tiempo
uint8_t 		rtcContIsReady = false;					// Contador para el RTC
uint8_t			rtcContFlag	   = false;					// Flag para activar la conversión continua del RTC

/* Variables para la configuración del MPU6050 */
#define numberofsensor 	3								// Cantidad de sensores
char		MPUBufferAccel[256];						// Buffer para almacenar los datos
char		MPUBufferGyro[256];							// Buffer para almacenar los datos
uint8_t		MPU6050IsReady					= false;	// Bandera para controlar la lectura de datos
uint8_t		accelFull						= false;	// Flag para activar la conversión continua del acelerómetro
uint8_t		gyrosFull						= false;	// Flag para activar la conversión continua del Giroscopio

/* Configuración para la OLED */
char 		bufferDataOLED[128] = {0};

/* Variables auxiliar. */
char 		bufferData[256] = "¡Hola! Soy el USART del STM32 y estoy funcionando.";		// Mensaje de Bienvenida
uint8_t 	rxData				= 0;				// Variable donde se guardarán los datos obtenidos por el RX
uint8_t 	i2cBuffer 			= 0;				// Buffer para el I2C
uint8_t		buzzerFlag			= false;
uint8_t		buzzerFlag2			= false;
/* Variables para los commands */
char		bufferReception[256];
char 		cmd[64];
char 		userMsg[256];

uint32_t		counterReception 		= 0;
uint8_t			stringComplete			= false;
unsigned int 	firstParameter 			= 0;
unsigned int  	secondParameter 		= 0;

// *************** // Headers // *************** //

void initSystem(void);										// Función para inicializar el sistema
void sensorConfig();										// Función para cargar la configuración del sensor
void parseCommands(char *ptrBufferReception);				// Función para generar los comandos por consola
void initialMessage(void);									// Función que contiene el mensaje de bienvenida
void defineSetAndTimeRTC(uint8_t minutesx, uint8_t hourx);	// Función para definir los valores iniciales del RTC
void stopMPU(void);											// Función para parar todos los procesos de conversión continua del MPU

// *************** // MAIN // *************** //
int main(void)
{
	// Inicializamos la FPU
	FPUInit();
	// Inicializamos el sistema
	initSystem();

	// Mandamos el mensaje de Bienvenida
	initialMessage();

	// Cargamos la configuración Inicial en la OLED
	OLED_Init(&handler_OLED);
	OLED_Clean(&handler_OLED);
	sprintf(bufferDataOLED, "<<<<<<<<<<<<<<<<  HOLA!          SOY EL STM32   <<<<<<<<<<<<<<<<");
	OLED_FPrint(&handler_OLED, bufferDataOLED);

	/* Main Loop */
	while(1){

		// Si se recibió un comando por consola haga
		if(rxData != '\0'){

			//Guardamos las cadenas para los comandos
			bufferReception[counterReception] = rxData;
			counterReception++;

			// Levantamos una bandera para indicar que se completó el comando
			if(rxData == '@'){
				stringComplete = true;
				// Agrego esta línea para crear el string con el null al final del arreglo
				bufferReception[counterReception] = '\0';
				counterReception = 0;
			}
			rxData = '\0';
		}

		// Hacemos un análisis de la cadena de datos obtenida
		if(stringComplete){
			// Llamamos a la función para implementar los comandos
			parseCommands(bufferReception);
			stringComplete = false;
		}

		// Comparaciones para obtener los datos del MPU en modo continuo
		if((MPU6050IsReady == true) && (accelFull == true)){

			// Leemos las aceleraciones del MPU6050 en x,y, y z.
			int16_t AccelX = MPU6050_SensorValue(&handler_MPU6050,ACCEL_X);
			int16_t AccelY = MPU6050_SensorValue(&handler_MPU6050,ACCEL_Y);
			int16_t AccelZ = MPU6050_SensorValue(&handler_MPU6050,ACCEL_Z);

			double fAccelX = AccelX*(9.81/16384.0);
			double fAccelY = AccelY*(9.81/16384.0);
			double fAccelZ = AccelZ*(9.81/16384.0);

			// NOTA: Descomentar si se quieren ver también los valores por consola

			// Imprimimos los valores por consola
			sprintf(MPUBufferAccel, " %f | %f | %f \n \r",fAccelX,fAccelY,fAccelZ);
			writeMsg(&handlerCommTerminal, MPUBufferAccel);

			// Imprimimos los valores por la pantalla OLED
			char bufferDataOLEDx[128] = {0};
			sprintf(bufferDataOLEDx, " ACCELX: %f ", fAccelX);
			OLED_FPrintPage(&handler_OLED, bufferDataOLEDx, PAGE_1);
			sprintf(bufferDataOLEDx, " ACCELY: %f ", fAccelY);
			OLED_FPrintPage(&handler_OLED, bufferDataOLEDx, PAGE_3);
			sprintf(bufferDataOLEDx, " ACCELZ: %f ", fAccelZ);
			OLED_FPrintPage(&handler_OLED, bufferDataOLEDx, PAGE_5);

			// Bajamos la bandera que controla el TIMER
			MPU6050IsReady = false;
		}
		// Comparaciones para obtener los datos del MPU en modo continuo
		else if((MPU6050IsReady == true) && (gyrosFull == true)){

			// Leemos los valores del giroscopio del MPU6050 en x,y, y z.
			int16_t GirosX = MPU6050_SensorValue(&handler_MPU6050,GYRO_X);
			int16_t GirosY = MPU6050_SensorValue(&handler_MPU6050,GYRO_Y);
			int16_t GirosZ = MPU6050_SensorValue(&handler_MPU6050,GYRO_Z);

			double fGirosX = GirosX*(250.0/32768.0);
			double fGirosY = GirosY*(250.0/32768.0);
			double fGirosZ = GirosZ*(250.0/32768.0);

