jutoroa/STM32F411RE/examenFinal_jutoroaV4/Src/examenFinalMainV4.c
		OLED_Clean(&handler_OLED);
		char bufferDataOLEDx[128] = {0};
		sprintf(bufferDataOLEDx, "EL MPU6050 HA   SIDO INICIADO   CORRECTAMENTE");
		OLED_FPrint(&handler_OLED, bufferDataOLEDx);

	}
	else if(strcmp(cmd, "accel") == 0){
		stopMPU();
		rtcContFlag = false;

		// Mostrar en eje X la aceleración
		if(firstParameter == 1){
			int16_t AccelX = MPU6050_SensorValue(&handler_MPU6050,ACCEL_X);
			sprintf(bufferData, "AccelX = %d \n",(int) AccelX);
			writeMsg(&handlerCommTerminal, bufferData);

			OLED_Clean(&handler_OLED);
			char bufferDataOLEDx[128] = {0};
			sprintf(bufferDataOLEDx, "  MODE SINGLE   ACCELX = %d \n",(int) AccelX);
			OLED_FPrint(&handler_OLED, bufferDataOLEDx);
		}
		else if(firstParameter == 2){
			int16_t AccelY = MPU6050_SensorValue(&handler_MPU6050,ACCEL_Y);
			sprintf(bufferData, "AccelY = %d \n",(int) AccelY);
			writeMsg(&handlerCommTerminal, bufferData);

			OLED_Clean(&handler_OLED);
			char bufferDataOLEDx[128] = {0};
			sprintf(bufferDataOLEDx, "  MODE SINGLE   ACCELY = %d \n",(int) AccelY);
			OLED_FPrint(&handler_OLED, bufferDataOLEDx);
		}
		else if(firstParameter == 3){
			int16_t AccelZ = MPU6050_SensorValue(&handler_MPU6050,ACCEL_Z);
			sprintf(bufferData, "AccelZ = %d \n",(int) AccelZ);
			writeMsg(&handlerCommTerminal, bufferData);

			OLED_Clean(&handler_OLED);
			char bufferDataOLEDx[128] = {0};
			sprintf(bufferDataOLEDx, "  MODE SINGLE   ACCELZ = %d \n",(int) AccelZ);
			OLED_FPrint(&handler_OLED, bufferDataOLEDx);
		}
		else{
			writeMsg(&handlerCommTerminal, "Acelerómetro no disponible \n");

			OLED_Clean(&handler_OLED);
			char bufferDataOLEDx[128] = {0};
			sprintf(bufferDataOLEDx, "                !!!! ERROR !!!!");
			OLED_FPrint(&handler_OLED, bufferDataOLEDx);
		}
	}
	else if(strcmp(cmd, "gyro") == 0){
		stopMPU();
		rtcContFlag = false;

		// Mostrar en eje X la aceleración
		if(firstParameter == 1){
			int16_t GirosX = MPU6050_SensorValue(&handler_MPU6050,GYRO_X);
			sprintf(bufferData, "GirosX = %d \n",(int) GirosX);
			writeMsg(&handlerCommTerminal, bufferData);

			OLED_Clean(&handler_OLED);
			char bufferDataOLEDx[128] = {0};
			sprintf(bufferDataOLEDx, "  MODE SINGLE   GYROX = %d \n",(int) GirosX);
			OLED_FPrint(&handler_OLED, bufferDataOLEDx);
		}
		else if(firstParameter == 2){
			int16_t GirosY = MPU6050_SensorValue(&handler_MPU6050,GYRO_Y);
			sprintf(bufferData, "GirosY = %d \n",(int) GirosY);
			writeMsg(&handlerCommTerminal, bufferData);

			OLED_Clean(&handler_OLED);
			char bufferDataOLEDx[128] = {0};
			sprintf(bufferDataOLEDx, "  MODE SINGLE   GYROY = %d \n",(int) GirosY);
			OLED_FPrint(&handler_OLED, bufferDataOLEDx);
		}
		else if(firstParameter == 3){
			int16_t GirosZ = MPU6050_SensorValue(&handler_MPU6050,GYRO_Z);
			sprintf(bufferData, "GirosZ = %d \n",(int) GirosZ);
			writeMsg(&handlerCommTerminal, bufferData);

			OLED_Clean(&handler_OLED);
			char bufferDataOLEDx[128] = {0};
			sprintf(bufferDataOLEDx, "  MODE SINGLE   GYROZ = %d \n",(int) GirosZ);
			OLED_FPrint(&handler_OLED, bufferDataOLEDx);
		}
		else{
			writeMsg(&handlerCommTerminal, "Giroscopio no disponible \n");
			OLED_Clean(&handler_OLED);
			char bufferDataOLEDx[128] = {0};
			sprintf(bufferDataOLEDx, "                !!!! ERROR !!!!");
			OLED_FPrint(&handler_OLED, bufferDataOLEDx);
		}
	}
	else if(strcmp(cmd, "accelfull") == 0){
		stopMPU();
		rtcContFlag = false;

		writeMsg(&handlerCommTerminal, "Aceleración Modo Continuo \n");
		writeMsg(&handlerCommTerminal, "X | Y | Z \n");

		// Conversión de modo continua
		accelFull = true;
		OLED_Clean(&handler_OLED);
	}
	else if(strcmp(cmd, "gyrofull") == 0){
		stopMPU();
		rtcContFlag = false;

		writeMsg(&handlerCommTerminal, "Giroscopio Modo Continuo \n");
		writeMsg(&handlerCommTerminal, "X | Y | Z \n");

		// Conversión de modo continua
		gyrosFull = true;
		OLED_Clean(&handler_OLED);
	}
	else if(strcmp(cmd, "initrtc") == 0){
		stopMPU();
		rtcContFlag = false;

		// Función para inicializar el RTC
		RTC_init(&handler_RTC);
		writeMsg(&handlerCommTerminal, "\n");
		writeMsg(&handlerCommTerminal, "Su RTC DS1307 ha sido inicializado correctamente. \n");

		OLED_Clean(&handler_OLED);
		char bufferDataOLEDx[128] = {0};
		sprintf(bufferDataOLEDx, " EL RTC HA       SIDO INICIADO   CORRECTAMENTE");
		OLED_FPrint(&handler_OLED, bufferDataOLEDx);
	}
	else if(strcmp(cmd, "setrtc") == 0){
		stopMPU();
		rtcContFlag = false;

		// Función para setear los valores iniciales del RTC
		defineSetAndTimeRTC(5, 30);
		RTC_SetDateTime(&handler_RTC, &dateAndTimeRTC);
		writeMsg(&handlerCommTerminal, "\n");
		sprintf(bufferData, "Se ha configurado la hora a %d:%d:%d \n",(int) dateAndTimeRTC.hour,
				(int) dateAndTimeRTC.minutes, (int) dateAndTimeRTC.seconds);
		writeMsg(&handlerCommTerminal, bufferData);

		OLED_Clean(&handler_OLED);
		char bufferDataOLEDx[128] = {0};
		sprintf(bufferDataOLEDx, " HORA INICIAL:    %d:%d:%d \n",(int) dateAndTimeRTC.hour,
				(int) dateAndTimeRTC.minutes, (int) dateAndTimeRTC.seconds);
		OLED_FPrint(&handler_OLED, bufferDataOLEDx);
		}
	else if(strcmp(cmd, "showtime") == 0){
		stopMPU();
		rtcContFlag = false;

		// Función para leer, horas, minutos y segundos.

		uint8_t sec = RTC_readByte(&handler_RTC,0x00);
		uint8_t min = RTC_readByte(&handler_RTC,0x01);
		uint8_t hora = RTC_readByte(&handler_RTC,0x02);

		writeMsg(&handlerCommTerminal, "\n");
		sprintf(bufferData, "La hora actual es %d:%d:%d \n", (int) hora, (int) min, (int) sec);
		writeMsg(&handlerCommTerminal, bufferData);

		OLED_Clean(&handler_OLED);
		char bufferDataOLEDx[128] = {0};
		sprintf(bufferDataOLEDx, " HORA ACTUAL:    %d:%d:%d \n",(int) hora, (int) min, (int) sec);
		OLED_FPrint(&handler_OLED, bufferDataOLEDx);
	}
	else if(strcmp(cmd, "showdate") == 0){
		stopMPU();
		rtcContFlag = false;
		// Función para leer la fecha en formato DD/MM/YY

		uint8_t day = RTC_readByte(&handler_RTC,0x04);
		uint8_t month = RTC_readByte(&handler_RTC,0x05);
		uint8_t year = RTC_readByte(&handler_RTC,0x06);

		writeMsg(&handlerCommTerminal, "\n");
		sprintf(bufferData, "La fecha actual es %d/%d/%d \n", (int) day, (int) month, (int) year);
		writeMsg(&handlerCommTerminal, bufferData);

