jutoroa/STM32F411RE/examenFinal_jutoroaV4/Src/examenFinalMainV4.c
		OLED_Clean(&handler_OLED);
		char bufferDataOLEDx[128] = {0};
		sprintf(bufferDataOLEDx, " FECHA ACTUAL:   %d:%d:%d \n",(int) day, (int) month, (int) year);
		OLED_FPrint(&handler_OLED, bufferDataOLEDx);
	}
	else if(strcmp(cmd, "showtimecont") == 0){
		stopMPU();

		// Función para leer la hora en tiempo real
		rtcContFlag = true;
		writeMsg(&handlerCommTerminal, "// ***** // RTC MODO CONTINUO // ***** // \n");
		OLED_Clean(&handler_OLED);

		char bufferDataOLEDx[128] = {0};
		sprintf(bufferDataOLEDx, " HORA:");
		OLED_FPrintPage(&handler_OLED, bufferDataOLEDx, PAGE_1);
		sprintf(bufferDataOLEDx, " FECHA:");
		OLED_FPrintPage(&handler_OLED, bufferDataOLEDx, PAGE_5);
	}
	else if(strcmp(cmd, "selfdestruction") == 0){
			stopMPU();
			rtcContFlag = false;

			writeMsg(&handlerCommTerminal, "// ***** // MODO DE AUTODESTRUCCION // ***** // \n");
			OLED_Clean(&handler_OLED);

			char bufferDataOLEDx[128] = {0};
			sprintf(bufferDataOLEDx, " INICIANDO   ");
			OLED_FPrintPage(&handler_OLED, bufferDataOLEDx, PAGE_3);
			sprintf(bufferDataOLEDx, " AUTODESTRUCCION");
			OLED_FPrintPage(&handler_OLED, bufferDataOLEDx, PAGE_5);

			buzzerFlag2 = true;
		}
	else{
		stopMPU();
		rtcContFlag = false;

		// Se imprime el mensaje "Wrong CMD" si la escritura no corresponde a los CMD implementados.
		writeMsg(&handlerCommTerminal, "Wrong CMD");
	}
}

//***********// stopMPU //***********//

void stopMPU(void){
	accelFull = false;
	gyrosFull = false;
	MPU6050IsReady = false;
}

//***********// initialMessage //***********//

void initialMessage(void){
	writeMsg(&handlerCommTerminal,"// ***** // BIENVENIDO A LA NERIONETA // ***** // \n");
	writeMsg(&handlerCommTerminal, "\n");
	writeMsg(&handlerCommTerminal,"─▌█──║─║╔═║─║─╔═╗─ \n");
	writeMsg(&handlerCommTerminal,"─███─╠═╣╠═║─║─║─║─ \n");
	writeMsg(&handlerCommTerminal,"─▐█▐─║─║╚═╚═╚═╚═╝─ \n");
	writeMsg(&handlerCommTerminal,"─▐▐─────────────── \n");
	writeMsg(&handlerCommTerminal,"─▐▐─────────────── \n");
	writeMsg(&handlerCommTerminal, "\n");
	writeMsg(&handlerCommTerminal, bufferData);
	writeMsg(&handlerCommTerminal, "\n");
	writeMsg(&handlerCommTerminal, "Escriba 'help @', para conocer el menú de ayuda. \n");
}
//***********// CallBacks //***********//

void USART6_Callback(void){
	// Lectura de los datos recibidos
	rxData = returnData();
}

// Timer encargado del StateLED
void Timer2_Callback(void){
	handlerStateLED.pGPIOx -> ODR ^= GPIO_ODR_OD5;		// Encendido y apagado StateLED
	buzzerFlag = true;
}

// // Timer encargado del muestreo a través del RTC
void Timer4_Callback(void){
	rtcContIsReady = true;
}

// Timer encargado del muestreo a través del MPU6050
void Timer5_Callback(void){
	MPU6050IsReady = true;
}
